#ifndef __GM6020_H__
#define __GM6020_H__ 
#include "stdint.h"
#include "can.h"

/* =============================================================================
 * gm6020 协议常量
* ============================================================================*/

/* 控制帧 CAN ID */
#define GM6020_CTRL_ID1TO4  0x1FF // 控制报文标识符,用于单片机向ID为1-4的电机发送控制报文
#define GM6020_CTRL_ID5TO8  0x2FF // 状态报文标识符,用于单片机向ID为5-7的电机发送状态报文 

/* 反馈帧 CAN ID基础地址, 实际地址 = CAN_ID_BASE + 电机拨码ID */
#define GM6020_FBK_ID_BASE   0x204 /* ID1 -> 0x205, ID7 -> 0x20B */

/* 电压范围 */
/*电压给定值范围：-25000~0~25000。 */
#define GM6020_VOLTAGE_MIN   (-25000)
#define GM6020_VOLTAGE_MAX   (25000)

/* 电流范围 */
/* 电流给定值范围：-16384~0~16384, 对应最大转矩电流范围 -3A~0~3A。 */
#define GM6020_CURRENT_MIN   (-16384)
#define GM6020_CURRENT_MAX   (16384)

/* 角度原始值范围(最大角度) */ 
#define GM6020_ANGLE_MAX  (8191)

/* =============================================================================
 * GM6020单个电机数据结构体
*============================================================================*/

/*
@brief  GM6020单个电机数据结构体,数据都由CAN反馈报文解析得到,都是数据手册中定义的,这些数据都是电机发送给单片机的数据
@note   该结构体用于保存单个电机的数据
@param  angle:  机械角度, 0~8191, 对应0~360度
@param  speed:  电机角速度, 单位: rpm, 正负代表方向
@param  current:  电机实际扭矩电流
@param  temperature:  电机温度, 单位: ℃
*/
typedef struct
{
    uint16_t angle;             /* 机械角度, 0~8191, 对应0~360度 */
    int speed;                  /*  电机角速度, 单位: rpm, 正负代表方向 */
    int current;                /* 实际扭矩电流 */ 
    uint8_t temperature;        /* 电机温度, 单位: ℃*/
    uint32_t timestamp;         /* 最新一次收到反馈的时刻 ( HAL_GetTick() ) */ 
}GM6020_t;

/* =============================================================================
 * 全局反馈数组
 * 下标 = 电机拨码ID( 1~7 ), 拨码0不使用
 * 在中断回调函数中更新数据, 在主函数中读取数据
*============================================================================*/
extern GM6020_t gm6020[8];

/* =============================================================================
 * 函数声明
*============================================================================*/

#endif
